<?php
/**+----------------------------------------------------------------------
 * JamesPi Redis [php-redis]
 * +----------------------------------------------------------------------
 * RabbitMQ Service Configuration file
 * +----------------------------------------------------------------------
 * Copyright (c) 2020-2030 http://www.pijianzhong.com All rights reserved.
 * +----------------------------------------------------------------------
 * Author：PiJianZhong <jianzhongpi@163.com>
 * +----------------------------------------------------------------------
 */

return [
    'Basic' =>[
        'host' => '192.168.109.54',
        'port' => '5672',
        'username' => 'admin',
        'password' => 'admin'
    ],
    'is_strict_mode' => false, //是否开启严格模式【开启事务+生产端确认机制，高可靠性但会降低性能】
    'is_persistence' => true, //是否开启持久化
    'operating_mode' => 1, // 服务模式【1：单一节点模式  2：普通(集群)模式  3：镜像节点(集群)模式】
    'scene_mode' => 1, // 交换器模式【1：fanout，适用于广播 2：direct，应用精准匹配 3：topic，应用于模糊范围匹配】

];